In [6]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from urllib.parse import quote_plus
username="root"
password=quote_plus ("GodisLove@316")
db_name="sakila"
connection=f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

"![png](https://assets.codingdojo.com/boomyeah/company_209/chapter_3569/handouts/chapter3569_5431_sakila-db-model.png)"

### 1. What query would you run to get all the customers inside city_id = 312? 
#### Your query should return the customers' first name, last name, email, address, and city.

In [10]:
q = """SELECT customer.first_name, customer.last_name, customer.email
FROM customer
JOIN city ON city_id = customer.customer_id
WHERE city_id = 312;"""
pd.read_sql(q, engine)

  first_name last_name                             email
0       MARK  RINEHART  MARK.RINEHART@sakilacustomer.org

### 2. What query would you run to get all comedy films?
#### NOTE: The genre is called the category in this schema. Your query should return the film title, description, release year, rating, and special features.

In [12]:
q = """SELECT film.title, film.description, film.release_year, film.rating, film.special_features
FROM film
JOIN film_category ON film.film_id = film_category.category_id
WHERE category_id = "comedy""""

SyntaxError: EOL while scanning string literal (2031158206.py, line 4)

### 3. What query would you run to get all the films that Johnny Lollobrigida was in?
#### Your query should return the actor's last name, film title, and release year.

In [14]:
q = """SELECT film.title, film.release_year
FROM film
JOIN actor ON actor.actor_id = film.film_id
WHERE actor_id = 'Johnny Lollobrigida';"""

### 4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [15]:
q = """SELECT actor.first_name, actor.last_name
FROM actor
JOIN film ON film.film_id = actor.actor_id
WHERE film.title = 'Bingo Talented';"""

### 5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount?
#### HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount

In [16]:
q = """SELECT customer.customer_id
FROM customer
JOIN payment ON payment.amount = customer.customer_id
WHERE payment.amount > 2* (AVG)payment.amount"""

### 6. What query would you run to list the first and last names of the 5 customers who have the highest number (count) of payments?
#### You can title the number of payments as num_payments

In [ ]:
SELECT payment, COUNT(payment_id) as num_payments
FROM payment
JOIN customer ON payment.payment_id = customer.customer_id
WHERE MAX(payment);